Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །ལྷ་ཐམས་ཅད་ཀྱིས་ཀྱང་ཀུན་ཏུ་བསྲུང་ཞིང་ཕྱག་བགྱི་བའི་འོས་སུ་འགྱུར་རོ།
en: All the deities will protect him and praise him.

source: །ཐོས་པ་བསགས་པའི་རྒྱ་མཚོ་ཆེན་པོར་ཡང་འགྱུར་རོ། །གལ་ཏེ་རིག་སྔགས་འཆང་ཕྱོགས་བཅུ་དུས་གསུམ་ཐམས་ཅད་ཀྱི་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་དང་བཅས་པ་རང་སངས་རྒྱས་དང་། འཕགས་པ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཐམས་ཅད་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་།
en: He will become an ocean-like receptacle of great learning. “

source: ལྟོ་འཕྱེ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་མངོན་པར་དད་པ་དང་བཅས་པ་ལ་མཆོད་པ་བགྱིད་པར་འཚལ་བའམ། ཕྱོགས་བཅུ་དུས་གསུམ་དུ་གཏོགས་པ་ཐམས་ཅད་ཀྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་ཡོངས་སུ་རྫོགས་པར་འཚལ་བའམ། དགེ་བའི་རྩ་བ་ཆེན་པོ་བསྐྱེད་པར་འཚལ་བའམ། ལྷའི་ཞལ་ཟས་ཀྱི་མཆོག་རོ་བྲོ་བའི་མཆོག་དང་ལྡན་པའི་བཟའ་བ་དང་། ལྷའི་བཅུད་ཀྱིས་ལེན་གྱི་མཆོག་གིས་དེ་བཞིན་གཤེགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། རང་སངས་རྒྱས་དང་། འཕགས་པ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཐམས་ཅད་ལ་བསྟབས་པར་འཚལ་བའམ། སྦྱིན་པ་མང་པོ་དང་། ཆེན་པོ་གཏོང་བར་འཚལ་བའམ། ཉིན་རེ་ཞིང་མཆོད་པའི་སྤྲིན་བགྱིད་པར་འཚལ་ན། རིག་སྔགས་འཆང་དེས་ལེགས་པར་བཀྲུས་ཏེ། གཙང་མས་གོས་གཙང་མ་བགོས་ནས། ཅི་འབྱོར་པས་དཀྱིལ་འཁོར་གྲུ་བཞིར་བགྱིས་ལ།
en: If the vidyā holder wants to make offerings to all the tathāgatas of the three times and the ten directions, who are surrounded by retinue-hosts of bodhisattvas and the congregations of pratyekabuddhas and noble śrāvakas, along with the devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas who are favorably disposed to the teachings of the Buddha; if he wants to accumulate great merit equal to that of all the tathāgatas of the three times and the ten directions; if he wants to plant the roots of great virtue; if he wants to satiate all the tathāgatas, bodhisattvas, pratyekabuddhas, and the hosts of noble śrāvakas with the divine elixir of immortality and the best of food and drink; if he wants to make large donations or offer worship every single day with clouds of offerings, he should bathe, purify himself ritually, put on clean clothes, and prepare a four-sided maṇḍala as is practicable.

source: བཅོམ་ལྡན་འདས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་མདུན་དུ་མེ་ཏོག་དང་། བདུག་པ་ཡང་དག་དབུལ་བར་བགྱིའོ།
en: The vidyā holder should then offer flowers and burn incense in front of the painting of the Blessed Lord, Noble Avalokiteśvara.

source: །པུས་མོ་བཙུགས་ཏེ་ཐལ་མོ་སྦྱར་ནས་ཞགས་པ་བཟུང་སྟེ།
en: Kneeling down, he should hold the noose with his hands folded in the añjali gesture.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཡིད་ལ་བགྱིའོ། །ཡིད་བཞིན་གྱི་ནོར་བུ་ཆེན་པོ་རྒྱ་ཆེན་དོན་ཡོད་འདི་ཡང་མཆོད་པར་བགྱིའོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྙིང་པོ་ལན་བདུན་བཟླས་པར་བགྱིའོ། །ཡིད་ལ་བགྱིད་པ་ཡངས་པ་རྒྱ་ཆེན་པོ་མཆོད་པའི་སྤྲིན་ཆེན་པོ་དང་། སྦྱིན་གཏོང་ཆེན་པོ་དང་། ཁ་ཟས་དང་། བཏུང་བ་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ཆོས་གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: Keeping all the tathāgatas in his heart, he should offer a large pūjā to the great wish-fulfilling amogha jewel and recite the heart mantra of Noble Avalokiteśvara seven times.

source: གོས་དང་། རྒྱན་དང་། ལྷབ་ལྷུབ་དང་། རྒྱན་འཕྱང་དང་། རོལ་མོ་དང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དང་།
en: He should visualize large and extensive clouds of offerings and offer gifts consisting of food, drink, perfume, garlands, scented oils, scented powders, robes, parasols, banners, flags, clothes, ornaments, adornments, jewelry, song, music, and the sound of tāḍāvacaras.

source: རིན་པོ་ཆེའི་ལྗོན་ཤིང་དང་། འབྲས་བུའི་ལྗོན་ཤིང་དང་། མེ་ཏོག་གི་ལྗོན་ཤིང་དང་། མར་མེའི་ལྗོན་ཤིང་དང་། དཔག་བསམ་གྱི་ལྗོན་ཤིང་ཡིད་ལ་བགྱིས་ཏེ།
en: He should visualize jewel trees, fruit trees, blossoming trees, lamp trees, and wish-fulfilling trees. “

source: གསང་སྔགས་ཀྱི་གཟུངས་བཟླས་ནས་ཇི་ལྟར་ཡིད་ལ་བསམས་ཤིང་དོན་དུ་གཉེར་བ་བཞིན་ཕྱོགས་བཅུར་འཕངས་ན།
en: While reciting this dhāraṇī mantra, he should swing the noose in the ten directions and wish for the visualized things to manifest.

source: དེའི་ཚེ་ཕྱོགས་བཅུ་དུས་གསུམ་དུ་གཤེགས་པ་དཀྱིལ་འཁོར་མཐའ་དག་ཏུ་གཏོགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་མཁོ་བའི་ཡོ་བྱད་ཐམས་ཅད་མ་ཚང་བ་མ་མཆིས་པར་ཅི་བསམས་པ་བཞིན་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་སྤྱན་སྔར་མཆོད་པའི་ཆར་གྱི་སྤྲིན་ཆེན་པོ་འབྱུང་བར་འགྱུར་རོ།
en: Consequently, all useful items will manifest, just as he wanted and in perfect condition, in front of the tathāgatas of the three times who dwell in the ten directions together with their retinues. Great clouds of offerings will appear, raining down offerings.

source: །དེ་བཞིན་དུ་མཁོ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱི་མཆོད་པ་ཆེན་པོ་མ་ཚང་བ་མ་མཆིས་པར་འབྱུང་བར་འགྱུར་རོ།
en: All useful items will manifest in perfect condition as great clouds of offerings.

source: །དེ་བཞིན་དུ་མཐུ་ཆེན་པོའི་ནོར་བུ་རྒྱ་ཆེན་དོན་ཡོད་ལ་མཆོད་པའི་གཟུངས་བཟླས་ཤིང་།
en: This very powerful dhāraṇī that produces vast clouds of precious amogha offerings is the heart essence of Noble Avalokiteśvara. “

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྙིང་པོའི་གཟུངས་འདི་ཡང་ཉིན་གཅིག་བཞིན་དུ་ཐུན་གསུམ་དུ་ལན་གསུམ་དུ་བཟླས་པར་བགྱིའོ། །དེ་ནས་རིག་སྔགས་འཆང་གིས་དུས་གསུམ་དུ་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དང་བཅས་པ་དེ་དག་མཉེས་པར་བགྱིས་པ་དང་།
en: If the vidyā holder recites this dhāraṇī three times at each of the three junctions of the day every day, the tathāgatas of the three times together with their retinues will be pleased with him.

source: མཆོད་པ་བགྱིས་པ་དང་། རིམ་གྲོ་བགྱིས་པར་འགྱུར་རོ། །བསོད་ནམས་ཀྱི་ཕུང་པོའི་ཚོགས་ཆེན་པོ་དང་། དགེ་བའི་རྩ་བ་ཆེན་པོ་བསྐྱེད་པར་འགྱུར་རོ།
en: If he thus worships and venerates them, he will accumulate a great deal of merit and plant many roots of virtue.

source: །དུས་གསུམ་དུ་གཏོགས་པའི་དེ་བཞིན་གཤེགས་པ་འཁོར་གྱི་དཀྱིལ་འཁོར་དང་བཅས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་རིག་སྔགས་འཆང་ལ་དྲན་པ་དང་། བློ་གྲོས་དང་སྟོབས་དང་བརྩོན་འགྲུས་དང་གཟི་བརྗིད་སྩོལ་བར་འགྱུར་རོ།
en: All the tathāgatas of the three times together with their retinues will grant him excellent memory, intellect, strength, energy, and vitality.

source: །ཉིན་གཅིག་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཐོང་བར་འགྱུར་རོ། །རྟག་ཏུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་དགོངས་པར་འགྱུར་རོ།
en: All the tathāgatas will appear to him in person every day and will always think of him.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རྟག་ཏུ་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ། །རྟག་ཏུ་མཆོག་སྦྱིན་པ་མཐོང་བར་འགྱུར་རོ།
en: He will always have a bond with Noble Avalokiteśvara, who will appear to him in person and grant him boons. “

source: །མཐོང་བའི་ཆོས་ལ་འཁོར་བའི་སྡུག་བསྔལ་འཇིགས་པ་འཇིགས་སུ་རུང་བ་དང་། སྐྲག་པ་དང་། དངང་བ་རྣམས་ཞི་བར་འགྱུར་རོ།
en: In this very life, they will pacify all the vidyā holder’s suffering and fear of saṃsāra, which is so frightening and terrifying.

source: །ནད་ཀྱིས་ཀྱང་གནོད་པར་མི་འགྱུར་རོ། །རིམས་ཀྱིས་མ་ལགས། དུག་གིས་མ་ལགས། དུག་སྦྱར་མས་མ་ལགས། སྦྱོར་བས་མ་ལགས།
en: He will never fall ill again and will not succumb to fever or come into contact with poison or toxins.

source: མཚོན་གྱིས་མ་ལགས། མེས་མ་ལགས། ཆུས་མ་ལགས་ཏེ། ལུས་ལ་སེར་བ་འབབ་པར་མི་འགྱུར་རོ།
en: His body will not be harmed by weapons, fire, or water.

source: །དགྲས་འཇིགས་པར་མི་འགྱུར་ཏེ། ཕ་རོལ་གྱི་དཔུང་གི་འཇིགས་པས་མ་ལགས། ཕ་རོལ་གྱི་སྡེའི་འཇིགས་པས་མ་ལགས། ཕས་ཀྱི་རྒོལ་བ་དང་མི་མཛའ་བའི་འཇིགས་པས་མ་ལགས། ལྷའི་འཇིགས་པས་མ་ལགས།
en: He will face no danger from enemies, foreign soldiers and armies, opponents, or adversaries.

source: ཀླུའི་འཇིགས་པས་མ་ལགས་ཏེ། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། སྲིན་པོ་དང་།
en: He need not fear devas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, rākṣasas, ḍākinīs, or shapeshifting yoginīs.

source: མཁའ་འགྲོ་མ་དང་། འདོད་དགུར་བསྒྱུར་བ་དང་། སྦྱོར་བ་མོའི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་རོ། །དཔག་ཚད་གཅིག་གི་ནང་ཚུན་ཆད་གཟུང་བར་མི་ནུས་ཤིང་། རྒྱང་རིང་པོར་འབྲོས་པར་འགྱུར་ཏེ།
en: They will not be able to approach him within the radius of one league and will flee far away.

source: དེ་ལ་བགེགས་བགྱིད་པར་མི་འགྱུར་རོ།
en: No obstacles will arise for him. “

source: །གང་དག་མནར་མེད་པར་གནས་པར་འགྱུར་བའི་སེམས་ཅན་ནམ། མཚམས་མེད་པ་ལྔ་བགྱིད་པའམ། འཕགས་པ་ལ་སྐུར་བ་འདེབས་པའམ། དམ་པའི་ཆོས་སྤོང་བའམ། བསྐལ་པ་བྱེ་བར་བསགས་པའི་ལས་ཀྱི་སྒྲིབ་པས་ལུས་ཡོངས་སུ་དཀྲིས་པ་གང་ལགས་པ་དེ་ཡང་མཐོང་བའི་ཆོས་ལ་ཐམས་ཅད་ལྷག་མ་མ་ལུས་པར་ཡོངས་སུ་གཏུགས་པར་འགྱུར།
en: Any being who has committed the five acts of immediate retribution and is destined to be reborn in the Avīci hell, any being who criticizes the noble ones and rejects the true Dharma, and any being whose body is beset with karmic obscurations accumulated over hundreds of thousands of eons will exhaust all his negativities and win liberation in this very life. “

source: ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ། །གལ་ཏེ་ཚིག་གཞན་མི་སྨྲ་བར་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིད་ཅིང་། སྨྱུང་བ་ལན་ཅིག་བགྱིས་ཏེ། བཟླས་བརྗོད་བྱས་ན་དེ་བསྐལ་པ་བྱེ་བ་ཕྲག་བརྒྱ་སྟོང་དུ་འཁོར་བར་སྐྱེ་བ་ལས་ཕྱིར་ཟློག་པར་འགྱུར་རོ། །གཟུངས་ཀྱི་བཟླས་བརྗོད་ཀྱིས་ལས་ཀྱི་སྒྲིབ་པ་སྔ་མ་རྣམས་ཀྱང་འབྱང་བར་འགྱུར་ཞིང་།
en: If the vidyā holder recites the dhāraṇī one thousand and eight times without speaking any other words—if he performs this recitation even once during a fast—the recitation will free him from the karma he accumulated over hundreds of thousands of millions of births, and he will leave saṃsāra.

source: བསྐལ་པ་སྟོང་དུ་བསགས་པའི་སྡིག་པ་རྣམས་ཉམས་པར་འགྱུར་རོ། །འཁོར་བའི་ཉེས་པས་ཕྱིར་ཡང་གོས་པར་མི་འགྱུར་ཏེ།
en: His evil deeds accumulated over thousands of eons will be purified, and he will no longer be defiled by saṃsāra’s faults, just as a lotus is not defiled by mud.

source: སྡིག་པ་དང་སྒྲིབ་པ་ཐམས་ཅད་ཀྱིས་པདྨ་བཞིན་དུ་གོས་པར་མི་འགྱུར་རོ། །མཐོང་བའི་ཆོས་ལས་ལྔ་པ་ཐོབ་པར་འགྱུར་རོ།
en: Like a lotus he cannot be defiled by any wrongdoings or obscurations, and he will obtain the fifth bodhisattva stage in this life.

source: །བསྟེན་པ་ཙམ་མམ་ཆོ་གའི་བཟླས་བརྗོད་ལ་ངེས་པར་གནས་ན། ཕྱིར་མི་ལྡོག་པའི་གནས་ཐོབ་པར་འགྱུར་རོ།
en: Through his practice, which adheres to the rules of the recitation procedure, he will attain the level of not turning back.

source: །དྲན་པ་ཙམ་གྱིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུའི་རྗེས་སུ་མཆི་བར་འགྱུར་རོ།
en: Merely through recitation, he will accomplish the six perfections and live in accordance with the ten perfections. “

source: །ཉིན་གཅིག་བཞིན་དུ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ན། མཐོང་བའི་ཆོས་ལ་ཀུན་ཏུ་བཟང་པོ་ཉིད་ཐོབ་པར་འགྱུར་རོ།
en: If the vidyā holder recites the dhāraṇī every day one hundred and eight times, he will attain the state of Samantabhadra in this very life.

source: །གསང་སྔགས་དང་ཆོ་ག་ཞིབ་མོ་དང་། དཀྱིལ་འཁོར་དང་ཕྱག་རྒྱ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཞུགས་པ་དང་།
en: He will gain access to all mantra rites, maṇḍalas, and mudrās.

source: དམ་ཚིག་ཐམས་ཅད་ལ་ཞུགས་པར་འགྱུར་རོ།
en: He will enter all the samayas and will be in accord with the way everything comes together.

source: །ཡང་དག་པར་སྐྱེད་པ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ། །རིག་སྔགས་འཆང་མཐོང་བ་ཙམ་གྱིས། མནར་མེད་པར་གནས་པ་རྣམས་ཀྱི་སྡིག་པ་རྣམ་པར་འཇིག་པར་འགྱུར་རོ། །ཆུང་ངུ་ན་རིག་སྔགས་འཆང་དུར་ཁྲོད་དུ་ཞུགས་ནས་གུམ་པའི་རུས་པའམ།
en: By merely seeing it, all the vidyā holder’s wrongdoings that would otherwise lead to rebirth in the Avīci hell will be eradicated. “

source: གུམ་པའི་ཤའམ། གུམ་པའི་རོ་རུལ་བའམ། ཆུང་ངུ་ན་གུམ་པའི་གོས་པོར་བའམ། རྩིག་པའི་རི་མོ་ལ་རིག་སྔགས་འཆང་དེའི་གྲིབ་མས་ཕོག་པར་གྱུར་ན། སེམས་ཅན་དེ་གང་དང་གང་གིས་དམྱལ་བར་གཞོལ་བར་འགྱུར་བ་དེ་དང་དེ་ནས་མོད་ལ་ཐར་ནས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: At the very least, when the vidyā holder enters a charnel ground and his shadow falls on a corpse’s bones, flesh, or rotten remains, or even just a deceased person’s discarded shroud, their garlands, or a painting on a wall, those beings on whose remains the shadow falls will be instantly liberated and will ascend to the realm of Sukhāvatī, even if they were destined to be reborn in hell.

source: དེ་ལ་ཡིད་གཉིས་སམ་སོམ་ཉི་བསྐྱེད་པར་མི་བགྱིད་ན། གང་དག་ཆེས་མང་དུ་ལྟག་པར་བགྱིད་པར་འགྱུར་བ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ། གང་རིགས་ཀྱི་བུ་པོའམ། རིགས་ཀྱི་བུ་མོའམ། དགེ་སློང་ཕའམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ཕའམ།
en: This should not be doubted or questioned.

source: དགེ་བསྙེན་མའམ། དད་པའི་རྗེས་སུ་འབྲང་བ་འགའ་ཞིག་གཟུངས་འདི་འཆང་བར་བགྱིད་དམ། བརྗོད་པར་བགྱིད། ཀློག་པར་བགྱིད། འདོན་པར་བགྱིད། སེམས་པར་བགྱིད།
en: How much more is this the case for those for whom the vidyā holder performs dedicated rites. “

source: བསྒོམ་པར་བགྱིད། མཆོད་པར་བགྱིད། བྲི་བར་བགྱིད། འདྲིར་འཇུག་པར་བགྱིད་ན། དེ་ངེས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: If any son or daughter of noble family, a monk or a nun, a male or a female lay practitioner, or any person with faith upholds this dhāraṇī, propagates it, recites it, memorizes it, contemplates it, meditates on it, makes offerings to it, writes it down, or commissions it to be written, they will never again turn back from supreme, perfect awakening.

source: །མཐོང་བའི་ཆོས་ལ་ཡོན་ཏན་ཆེན་པོ་བརྒྱ་སྟོང་མང་པོ་མཐོང་བར་འགྱུར་རོ།
en: They will obtain hundreds of thousands of great qualities in this very life.

source: །འདི་ཉིད་བཅངས་ན། མཐོང་བའི་ཆོས་ལ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་དང་།
en: By means of this dhāraṇī, they will, in this very life, accumulate the roots of every virtue.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་རྗེས་སུ་མཐུན་པའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: By applying the six perfections, their accumulation will become complete. “

source: །གཟུངས་འདི་ཉིད་རེ་ཞིག་ཀུན་ཆུབ་པར་བགྱིས་ནས། མཁོ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ན། དགོས་པ་མང་པོས་གྲིམས་པར་བགྱིད་པ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ། དེ་ནས་རིག་སྔགས་འཆང་དོན་ཡོད་ཡིད་བཞིན་ནོར་བུའི་ཞགས་པ་བསྒྲུབས་ནས་ཡིད་ལ་བསམས་ཏེ། བསམས་པའི་ལས་ཐམས་ཅད་བགྱིས་ན་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་རོ།
en: As this dhāraṇī, when accomplished, brings every possible benefit, what is the point of the vidyā holder exhausting himself with too many undertakings if, once he has accomplished the wish-fulfilling amogha jewel-noose, he can accomplish every activity he sets out to do?

source: །དགོས་པད་ང་བགྱི་བ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་རོ།
en: Any tasks that need to be carried out will be accomplished.

source: །ཅི་ལྟར་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་མཆོག་སྦྱིན་མངོན་སུམ་དུ་མཐོང་ནས། ལུང་བསྟན་པ་བཞིན་དུ་དོན་ཡོད་པའི་ཡིད་བཞིན་གྱི་ནོར་བུའི་ཞགས་པ་འདི་དེ་བཞིན་དུ་བལྟ་བར་བགྱི་སྟེ།
en: Just as he can obtain boons and a prophecy about his future awakening when seeing Noble Avalokiteśvara face-to-face, so too can he obtain the same when seeing this wish-fulfilling amogha jewel-noose.

source: འདི་ལ་ཡིད་གཉིས་མི་བགྱིའོ།
en: He should not harbor doubts about this. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཞགས་པ་མགྲིན་པར་བཏགས་ལ། ལག་པ་གཡས་པས་ནོར་བུ་བླངས་ཏེ། ལག་པ་གཡོན་པས་ལྕགས་ཀྱུ་བླངས་ན་མི་གདའ་བར་གྱུར་ནས། གར་དགའ་བ་དེར་འཇུག་པར་འགྱུར་ཏེ།
en: If the vidyā holder puts the noose around his neck and takes the jewel and goad into his right and left hands respectively, he will become invisible and will be able to enter any place he wants.

source: མཚན་མོ་ཡང་ནོར་བུའི་འོད་ཀྱི་སྣང་བས་ཉིན་པར་ཅི་ལྟ་བ་བཞིན་མཐོང་བར་འགྱུར་རོ། །ཐམས་ཅད་དུ་ལྷའི་གནས་སུ་འཇུག་པ་དང་། ཀླུ་དང་།
en: The light emanating from the jewel will make the night become as bright as day.

source: གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅིའི་གནས་དང་།
en: He can enter any place, including the abodes of devas, nāgas, yakṣas, rākṣasas, asuras, garuḍas, kinnaras, and mahoragas.

source: ལྟོ་འཕྱེ་ཆེན་པོའི་གནས་དང་། རི་སུལ་གྱི་ཕུག་དང་། རི་དང་། ནགས་ཚལ་དང་། ཐང་གི་སྒོ་རྣམས་འབྱེ་བར་འགྱུར་རོ།
en: Entrances to caves, mountains, forests, and subterranean paradises will fall open.

source: །ཐམས་ཅད་དུ་མི་མངོན་པར་ཞུགས་ནས་སླར་ལྡོག་པར་འགྱུར་ཞིང་ཅི་འཚལ་བ་དེ་བགྱིད་པར་འགྱུར་རོ།
en: The vidyā holder can enter and exit anywhere without being seen and do whatever he pleases.

source: །མི་རྣམས་ཀྱི་ནང་དུ་ལྷའི་ཚེ་ལོ་བརྒྱར་འཚོ་བར་འགྱུར་རོ།
en: He will live among humans for one hundred celestial years.

source: །ཉོན་མོངས་པ་དང་། ཉེས་པའི་སྐྱོན་ཐམས་ཅད་སྤངས་པར་འགྱུར་རོ།
en: All his afflictions, impurities, and faults will be pacified. “

source: །འོན་ཏེ་རིག་སྔགས་འཆང་གིས་གྲུབ་པའི་དོན་ལ་བརྟག་པར་འཚལ་ན། ཟླ་བ་ཡར་གྱི་ངོའི་ཚེས་བརྒྱད་དམ། བཅུ་བཞི་ལ་ལེགས་པར་ཁྲུས་བགྱིའོ། །གཙང་མས་གོས་གཙང་མ་བགོ་བར་བགྱིའོ། །གཙང་མའི་གནས་སམ།
en: If the vidyā holder wants to know how to accomplish the required tasks, he should, on the full moon, eighth day, or fourteenth day of the waxing moon, bathe, purify himself ritually, and put on clean clothes.

source: ཕྱོགས་སུ་བའི་ལྕི་བ་སྟེ། བའི་རྣམ་ལྔས་ཡོངས་སུ་སྦྱང་བར་བགྱིའོ།
en: In a clean place, he should smear the ground with cow dung and purify it with the five products of the cow.

source: །གནས་དེའི་ནང་ལོགས་ཀྱི་དབུས་སུ་དྲིའི་དཀྱིལ་འཁོར་བགྱིའོ། །མེ་ཏོག་གི་སིལ་མ་བཀྲམ་ཞིང་བུམ་པ་གང་བས་བརྒྱན་ཅིང་།
en: In the center of that space, he should prepare a small perfumed maṇḍala, strewing it with flowers and arraying it with full jars.

source: སྤོས་སྣ་ཚོགས་ཀྱིས་བགོས་པའི་བདུག་པ་གཞག་པར་བགྱིའོ།
en: It should be made fragrant with various scents and various types of incense.

source: །དེ་ནས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་མདུན་དུ་སྟན་བཟང་པོ་བཤམས་ཏེ། ཤིན་ཏུ་མཉམ་པར་གཞག་པས་ཞགས་པ་སྦྲུལ་འཁྱིལ་བའི་ཚུལ་དུ་ཟླུམ་པོར་བསྐྱིལ་ནས་གཞག་པར་བགྱིའོ། །དབུས་སུ་ནོར་བུ་གཞག་པར་བགྱིའོ།
en: Then, in front of the painting of Noble Avalokiteśvara, he should prepare a divine seat and place upon it the noose, neatly coiled like a snake so that the jewel ends up right in the center. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་མཆོད་པར་བགྱིའོ། །དོན་ཡོད་རྒྱལ་པོའི་སྙིང་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིས་ནས། ཁྲོ་བོའི་རྒྱལ་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིའོ། །དེ་ནས་དོན་ཡོད་ཡིད་བཞིན་གྱི་ནོར་བུའི་སྙིང་པོ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ནས།
en: The vidyā holder should then perform the rite of worship, reciting the heart mantra of Amogharāja twenty-one times, the mantra of Krodharāja twenty-one times, and the heart mantra of the wish-fulfilling jewel-noose of Amogha one hundred and eight times.

source: དེའི་འོག་ཏུ་ཙནྡན་དང་། ཨ་ག་རུ་དང་། དུ་རུ་སྐའི་བདུག་པ་དབུལ་ཞིང་ནོར་བུ་ལ་བརྟག་པར་བགྱི་སྟེ། ཞགས་པ་དང་།
en: Then, he should offer incense of agarwood, sandalwood, and olibanum.

source: དེ་ཐམས་ཅད་ནོར་བུའི་ནང་ནས་གདའ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་གདའ་བའམ། བྱང་ཆུབ་སེམས་དཔའ་གདའ་བའམ། ལྷ་གདའ་བའམ། ཀླུ་གདའ་བའམ། གནོད་སྦྱིན་དང་།
en: If he watches the jewel attentively, he will see everything within the noose-surrounded jewel, including tathāgatas, bodhisattvas, devas, and nāgas.

source: སྲིན་པོ་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་གདའ་བ་དང་། འབྱུང་པོ་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་གདའ་བའམ།
en: He will see yakṣas, rākṣasas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas.

source: གཡུལ་འགྱེད་པ་གདའ་བའམ།
en: He will see battles and military conflicts.

source: ཚེ་རིང་བ་གདའ་བའམ། ཚེ་ཉམས་པ་གདའ་བའམ། ཚེ་འཕོ་བ་གདའ་བའམ།
en: He will see a person’s lifespan, when it will be exhausted, and their transition between lives.

source: རྒྱལ་སྲིད་གདའ་བའམ། གྲོང་འཐོབ་པའམ། ཡུལ་འཐོབ་པའམ། གྲོང་ཁྱེར་འཐོབ་པའམ། དབྱིག་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་ཌཱུརྱ་དང་། ཤང་ཀ་ཤི་ལ་དང་། བྱི་རུ་དང་།
en: He will see if someone will obtain a kingdom, a village, a province, or a city.

source: ས་ལེ་སྦྲམ་དང་། དངུལ་དང་། གོས་དང་། ལྷབ་ལྷུབ་དང་། རྒྱན་གདའ་བའམ།
en: He will see the locations of raw or smelted gold, jewels, pearls, beryl stones, mother-of-pearl, coral, silver, wrought gold, clothes, jewelry, ornaments, and decorations. “

source: ནོར་བསྒྱུར་བ་སྨྲ་བ་དང་། མིག་འཕྲུལ་སྨྲ་བའམ། ཞིང་སྨྲ་བའམ། གཏེར་སྨྲ་བའམ། འབྲུ་སྨྲ་བའམ།
en: He will receive information about metallurgy, magical displays, fields, treasure troves, and grain stores.

source: བུད་མེད་འཕྲོག་པའམ། ལས་བསྒྲུབ་པའམ། གསང་སྔགས་བསྒྲུབ་པའམ།
en: He will see how to obtain a girl, accomplish a rite or a mantra, enthrall someone, or obtain majestic power.

source: དབང་དུ་བགྱི་བའམ།
en: He will see all this inside the jewel.

source: ངོ་མཚར་བ་དེ་དག་ཐམས་ཅད་ནོར་བུའི་ནང་ནས་གདའ་བར་འགྱུར་ཞིང་དགེ་བའམ་མི་དགེ་བ། དེ་དག་ཐམས་ཅད་ཀྱང་གདའ་བར་འགྱུར་རོ། །ལོའམ། ལོ་ཕྱེད་དམ། གནོད་པའམ། འཚེ་བའམ། ཡམས་སམ། མི་ངས་སམ།
en: He will see everything, both the auspicious and the inauspicious.

source: མི་ངས་ཆེན་པོའམ། ཕྱུགས་ངས་སམ། གོར་རམ། རྟ་ནད་དམ། གླང་པོ་ཆེའི་ནད་དམ།
en: He will see rains and drought, all misfortunes, calamities, and catastrophes such as deadly plagues and pestilences, and the dying of animals such as cows, horses, and elephants.

source: རང་གི་དཔུང་ངམ། གཞན་གྱི་དཔུང་གི་འཇིགས་པ་དང་།
en: He will see great dangers and terrors, whether due to local or foreign armies.

source: སྐྲག་པ་ཆེན་པོ་དེ་དག་ཐམས་ཅད་མེ་ལོང་གི་དཀྱིལ་འཁོར་ལ་ཅི་ལྟ་བ་དེ་བཞིན་དུ་གདའ་བར་འགྱུར་ལགས་སོ།
en: He will see all this as if reflected in the mirror.

source: །གང་བསམས་ཤིང་གང་གཉེར་བར་འགྲུབ་པའམ། མི་འགྲུབ་པའམ། དགེ་བའམ།
en: He will see whatever he thinks of or requests, and he will see whether it is possible to accomplish it or not and whether it is auspicious or not.

source: མི་དགེ་བ་ཐམས་ཅད་གདའ་བར་འགྱུར་ཏེ། དེ་ལ་ཐེ་ཚོམ་དང་ཡིད་གཉིས་དང་སོམ་ཉི་མི་བགྱི་སྟེ།
en: This should not be doubted, dismissed, or questioned.

source: དངོས་པོ་དོན་གཞན་དུ་མི་འགྱུར་རོ།
en: No result other than the one desired will come about. “

source: །ཆར་མི་འབབ་པའི་དུས་སུ་ཀླུའི་གནས་སུ་ནོར་བུ་བཞག་ན། ཅི་ཙམ་འཚལ་བར་ཆར་གྱི་རྒྱུན་འབབ་པར་འགྱུར་རོ།
en: If during excessive rain the vidyā holder places the jewel in a pool inhabited by nāgas, the clouds will give off the desired amount of rain.

source: །ཧ་ཅང་ཆར་ཆེས་ན་ནམ་མཁའ་ལ་ནོར་བུ་བསྟན་ན་ཆར་ཆེན་པོ་འཆད་པར་འགྱུར་རོ།
en: If during a heavy downpour he displays the jewel to the sky, the downpour will stop.

source: །ཉི་མ་འཆར་ཁར་ཉི་མ་ལ་བསྟན་ན་ཉི་མ་བབས་ནས་མཆོག་ཐམས་ཅད་སྩོལ་བར་འགྱུར་རོ།
en: If at sunrise he displays the jewel to the rising sun, the god of the sun will descend and grant the vidyā holder every boon.

source: །ཟླ་བ་ཚེས་པ་ལ་བསྟན་ན་ཟླ་བ་བབས་ནས་འདོད་དགུ་ཐམས་ཅད་ཀྱི་མཆོག་སྩོལ་བར་བགྱིད་དོ།
en: If he displays the jewel to the new moon, the youthful god of the moon will descend and grant him every boon he desires.

source: །ཆུ་ཀླུང་ཆེན་པོར་བསྟན་ན་རིན་པོ་ཆེ་རྣམས་འབྱུང་བར་འགྱུར་རོ།
en: If he displays it to the middle of a great river, fine jewels will appear.

source: །ནགས་ཁུང་དུ་བསྟན་ན་སྨན་གྱི་རྫས་ཐམས་ཅད་རང་གི་གཟུགས་ཀྱིས་མདུན་ན་མཆིས་ནས་གང་གཉེར་བ་དེ་ལེན་པར་འགྱུར་རོ།
en: If he displays it in a clearing in the forest, all the medicinal substances and herbs will manifest before him in their own forms so that he can take whichever one he needs.

source: །རི་ཕུག་ཏུ་བསྟན་ན་སྨན་ཐམས་ཅད་འབབ་པར་འགྱུར་ཏེ། ཅི་འཚལ་བ་དེ་བླང་བར་བགྱིའོ།
en: If he displays it to a cleft in a mountain, all the herbs there will begin to glow, and he can then collect whichever ones he wants.

source: །འབྲུའི་ཕུང་པོ་ལ་བསྟན་ན་འབྲུ་ཐམས་ཅད་འདུ་བར་འགྱུར་ཏེ། གང་དུ་འཚལ་བ་དེར་འབྱུང་བར་འགྱུར་རོ། །མ་མོའི་གནས་སམ།
en: If he displays the jewel to a heap of grain, all the grain will be transported wherever he desires. “

source: ནག་པོ་ཆེན་པོ་ལ་བསྟན་ཏེ། སྤྱི་བོའི་གཙུག་ཏུ་བཞག་ན་ནག་པོ་ཆེན་པོ་མ་མོའི་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པ་རང་གི་གཟུགས་ཀྱིས་མདུན་ན་མཆིས་ནས། དབང་དུ་འགྱུར་ཞིང་དགོས་པ་ཐམས་ཅད་དང་ལས་ཐམས་ཅད་བགྱིད་པར་འགྱུར་རོ།
en: If the vidyā holder shows the jewel to Mahākāla in a place frequented by mātṛs and places it on his head, Mahākāla will arrive in person before him surrounded by a host of mātṛs, fall under his thrall, and carry out all the tasks assigned to him.

source: །རྒྱལ་པོའི་མངོན་སུམ་དུ་བསྟན་ན་ཡན་ལག་བཞིའི་དཔུང་དང་བཅས་པ། བློན་པོའི་ཚོགས་དང་བཅས། བཙུན་མོའི་འཁོར་དང་བཅས་པ། དབྱིག་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་ཌཱུརྱ་དང་། ཤང་ཀ་ཤིལ་དང་། བྱི་རུ་དང་། ས་ལེ་སྦྲམ་དང་།
en: If he displays the jewel to a king, the king will fall under his thrall along with his best troops in their four divisions, horses, ministers, ladies of the harem, and entire retinue.

source: དངུལ་དང་། གོས་དང་། རྒྱན་དང་། ལྷབ་ལྷུབ་དང་། རྒྱན་འཆང་བ་དང་། ཁང་པ་དང་།
en: They will be at the vidyā holder’s disposal along with their gold, gold bullion, jewels, pearls, beryl stones, mother-of-pearl, coral, silver, wrought gold, clothes, jewelry, adornments, ornaments, palaces, and other wonderful things.

source: ངོ་མཚར་དུ་བཅས་པ་དབང་དུ་གྱུར་ནས། ཇི་སྲིད་འཚོའི་བར་དུ་བསྙེན་བཀུར་བགྱིད་པར་འགྱུར་རོ།
en: They will attend upon the vidyā holder for the rest of their lives. “
